{
  "blogs": [
    {
      "title": "06/13/2021 Illnesses During a Pandemic",
      "body": "The COVID-19 pandemic has left many people stuck at home in isolation. Although these measures have helped decrease the spread of the virus, there has been an upsurge in other illnesses. For example, sleep disorders have been on the rise. Getting a good night's sleep is crucial because it allows an individual to recharge for the day and helps their body fight off diseases. This is why poor sleep results in catastrophic health issues. \n\nThe negative outcomes of the pandemic, such as isolation and job loss, have significantly harmed mental health. In fact, according to the Kaiser Family Foundation, four out of ten adults in the U.S have developed an anxiety disorder since the start of the pandemic. The shift towards a more digital path has further increased the prevalence of these issues. Quarantine has given people the opportunity to spend more time on their phones and watch TV due to a lack of meaningful activities. The New York Times found that there has been a 16% and 15.4% increase in use of streaming services such as Netflix and Youtube, respectively. \n\nFurthermore, learning from home has led to a drastic increase in using Zoom, Google Classroom, and Google Meet. However, staring at a screen for long periods of time can be especially detrimental because it can significantly disrupt someone’s sleep schedule. Too much screen time could result in eye fatigue, dry eyes, loss of focus, and retinal damage. Additionally, the pandemic has also been harmful to physical health. Due to a loss of physical activity, there has been an increase in muscle and joint pain. \n\nFor this reason, it is important to consider the impacts of screen time on health and to take a break every once in a while. This summer, it would be especially beneficial to consider ways to decrease screen time with new activities (such as reading a book, playing a sport, solving a puzzle, riding a bike, learning a new language, taking up an instrument, etc.) and to take this opportunity to reflect on both mental and physical health.",
      "author": "Elif Koch",
      "id": 1
    },
    {
      "title": "06/11/2021 Summer Activities",
      "body": "After this difficult school year, there is nothing more that students are looking forward to than summer vacation. What is normally a time of relaxation and recreation has also become a time of relief. Relief from wearing masks all day, release from our devices, and reconnecting with friends. \n\nAlthough it may be tempting to spend all day in bed, there are many fun and productive activities for students. Whether it be working at a job, getting a head start on next year’s schoolwork, or chilling out with friends, the summer vacation is one of the only times students chose how to spend their time. \n\nHere are a few ideas on how to spend your summer! \n\nRecreation: \n- Going to the beach \n- Kayaking/Canoeing \n- Swimming \n- Hiking \n- Camping \n- Roast s’mores \n- Go horseback riding \n- Rock climbing \n- Go-karting \n- Mini golfing \n- Peddle boating \n- Parasailing \n- Exploring New York City \n- Visiting monuments \n\nEmployment: \n- Being a camp counselor \n- Working at a country club \n- Babysitting \n- Lifeguarding \n- Being Maintenance Worker \n- Dog walking \n- Car washing \n\n School-Related Activities: \n- Internships \n- SAT/ACT studying \n- College summer courses \n- Reading \n- Learning a new language \n- Summer program at a college or university \n- Community Service",
      "author": "Jess Levy",
      "id": 2
    },
    {
      "title": "05/11/2021 Embarking on the Path Back to “Normal”",
      "body": "With summer around the corner, Americans are beginning to see the restrictions on masks loosen. The CDC recently announced on April 27 that fully vaccinated people are no longer required to wear a mask outdoors. That being said, partaking in outdoor activities, such as jogging and biking, or eating at outdoor restaurants are now permitted. However, officials still state that crowded settings and venues are exceptions to the easing of these precautions. For those who have not been vaccinated, the previous stringent guidelines still follow. Even the completely vaccinated still face many limits to the actions and contact they can make. Nonetheless, Americans are feeling a greater sense of normalcy as progress is made during this pandemic. \n\nAs of May 6, the CDC’s website reports that about 45% of the total population and 57% of those 18 and older have received at least one shot from the vaccination series. For teenagers, only those who are 16 and older are currently able to receive the vaccine under emergency authorization. In an effort to increase the number of vaccinated students before the next school year, Pfizer has been working towards expanding the use of vaccines for those between the ages of 12-15. The Food and Drug Administration (FDA) is expected to deliver the decision of authorizing the vaccine for this age group early next week. [Update: the FDA has approved Pfizer’s request to extend vaccines to 12-15-year-olds]. \n\nAlthough vaccines lower the risk of being infected by COVID-19, people should always keep in mind that they are still susceptible to infection, especially when finding themselves in high-risk settings. \n\nFurther updates and statistics may be found at the CDC’s official website.",
      "author": "Christine Song",
      "id": 3
    },
    {
      "title": "05/03/2021 Exciting News For Cycling Enthusiasts",
      "body": "For as long as I can remember, one of my favorite hobbies has been cycling. Nothing is more appealing to me during the Spring, Summer, and Fall months than biking as many miles as possible. \n\nIn many aspects, Long Island is an avid cyclist’s dream, especially near JFK high school where the start of Bethpage Bikeway is easily accessible. A person can follow this trail for 13.4 miles, from Manetto Hill and Woodbury Road (Woodbury) to Merrick Road and Ocean Ave. (Massapequa). The trail is ordinarily quiet and peaceful and includes beautiful foliage due to the abundance of trees. Massapequa Park (part of Massapequa Preserve) is located at the end of the trail and overlooks the navy blue Massapequa Lake. Since there is a nice walkway and plenty of rest areas, this is a common destination for my friends and me on short and frequent bike rides. \n\nFor longer bike rides, we often pass Massapequa Park and continue on Sunrise Highway until we reach Cedar Creek Park. Safety concerns are not problematic because there is a decent shoulder width and the total distance is 3-4 miles at most. Cedar Creek Park has the entrance to the Ocean Parkway bike path, which runs for 4 miles, ending at Jones Beach. Finally, the Ocean Parkway Coastal Greenway used to run for another 4 miles to Tobay Beach. However, the last time I visited the trail with my friends, we saw something astonishing: the trail was closed for heavy maintenance. Dejected and mounting feelings of disappointment, we were forced to turn around and return home. \n\nLater that night, curled in a blanket with a cup of tea in hand, I decided to search up “Ocean Parkway Coastal Greenway” and see what the issue was. Within mere seconds, my dismay over not completing the bike ride turned into pure euphoric bliss. They were adding an extension to the trail, which was going to be completed by June 2021. Cyclists, runners, skaters, and walkers alike would be able to travel an additional 10 miles to Captree State Park. Excitedly, I texted my friend, and we instantly began brainstorming the possibilities: having a “beach day” at West Gilgo Beach; taking pictures and watching sunsets by Cedar Beach; and most importantly, completing 62 miles in total, with no need to make the same trip twice or rely on extra road mileage. \n\nFast forward to the beginning of May, and the trail is open to the public. The news was announced in early March, just in time for warm weather. Ocean Parkway Coastal Greenway now spans the towns of Babylon and Islip. Hundreds of plants native to Long Island, including beach grass, evergreen trees, bayberry plants, and beach plums, line the new path. Also, people using the trail can view numerous educational panels with historical and environmental information. \n\nCoastal Greenway is certain to become a tourist attraction, similar to Montauk or the Hamptons. Discover Long Island CEO and President Kristen Jarnegin has expressed, “The addition of this new oceanfront... connects to additional trails and boasts stunning view of the Manhattan skyline and... is certain to be a favorite for both residents and visitors alike.” The trail is bound to attract all outdoorsy people, regardless of their interests. Personally, this is a dream come true, and I am invigorated by all the possibilities.",
      "author": "Michael Khalfin",
      "id": 4
    },
    {
      "title": "NA",
      "name": "Michael Khalfin",
      "position": "Editor-in-Chief",
      "bio": "Michael is a senior at POBJFK High School. He created the Hawkeye News Feed, the old version of this website, as well as the Hawkeye Weekly! He is also the President of the Mathletes Club. Some of his hobbies include swimming, listening to music, and hiking. He is very big on cycling — ask any of his friends and they will tell you that all he does is ride his bike. Additionally, he is a Seinfeld and Curb Your Enthusiasm junkie. Working on the paper is a great opportunity because he likes having an impact in his school and community. Overseeing this website gives him a chance to expand the Hawkeye. He looks forward to sharing his ideas and articles with you.",
      "id": 1424
    },
    {
      "title": "NA",
      "name": "Elif Koch",
      "position": "Layout Editor",
      "bio": "Elif is a junior at POBJFK High School. Her hobbies include reading books, listening to music, and most importantly drawing. Whenever she has free time, she likes to make both digital art and graphite drawings. Also, one of her main interests is research because it allows her to learn new things. Being a part of the Hawkeye is very important to her, for it allows her to contribute her interests and hobbies, including researching and designing. She looks forward to writing more articles for the club and sharing her ideas with the school.",
      "id": 805
    },
    {
      "title": "NA",
      "name": "Jess Levy",
      "position": "Arts & Entertainment Editor ‘21",
      "bio": "Jess graduated from POBJFK High School in 2021. She was always busy with her dance team, school work, or extracurricular clubs (she was in about six of them and on the board of four). In her free time, you could find her baking with her sister, binge-watching “The Vampire Diaries”, at the gym working out, or just hanging out with friends. While she rarely had time to, she loved shopping for sweaters because that’s all she wore. Her favorite season was “sweater weather” also known as winter. Working on the school paper was a great way for her to benefit her community and find her place among it. Now she attends Hofstra University!",
      "id": 853
    },
    {
      "title": "NA",
      "name": "Christine Song",
      "position": "Managing Editor",
      "bio": "Christine is a junior at POBJFK High School. She loves passing her time by drawing objects that catch her eye. Additionally, she enjoys making all sorts of crafts and binge watching shows. Being in the Hawkeye allows her to bring different ideas into the limelight, hopefully allowing other students to become more aware of the various perspectives in this world. Christine is very excited to continue writing articles and looks forward to the progression of this year’s Hawkeye.",
      "id": 1376
    },
    {
      "title": "NA",
      "name": "Alison Chertoff",
      "position": "Managing Editor",
      "bio": "Alison is a senior at POBJFK High School. She has been an active member of the Hawkeye for the past four years. She enjoys hanging out with her friends and going on walks after school. She likes being a part of the Hawkeye because she gets to share her ideas and interests with the rest of the school community. Also, she would like to inspire other students to take part in this amazing club that is offered at our school!",
      "id": 1463
    },
    {
      "title": "NA",
      "name": "Isabella Chen",
      "position": "Opinion Editor",
      "bio": "Isabella is a junior at POBJFK High School. Her hobbies include badminton, reading, and music. Music is a big part of her life. She loves singing, playing the piano, and guitar. She also, of course, loves writing. In her free time, you can find her reading a book, doing a puzzle, or hanging out with her dog. She is proud to be a member of the Hawkeye. It allows her to have a positive impact on her school community. She cannot wait to continue writing articles this year!",
      "id": 1211
    },
    {
      "title": "NA",
      "name": "Seth Schlank",
      "position": "Sports Editor ‘21",
      "bio": "Seth graduated from POBJFK High School in 2021. He was an avid sports fan, supporting the Yankees, Jets, Islanders, and Knicks. He enjoyed graphic design, reading, and writing just to name a few hobbies. Aside from writing for the Hawkeye, he wrote articles and conducted interviews with athletes across the sports landscape and about all things sports.  He was a proud member of the Hawkeye board, who now attends Binghamton!",
      "id": 1144
    },
    {
      "title": "NA",
      "name": "Tarunika Sasikumar",
      "position": "Layout Editor",
      "bio": "Tarunika is a senior at POBJFK High School. In her free time she enjoys volunteering, reading books, and spending time with her family! Additionally, she enjoys playing tennis, karate, and listening to music. She is also a major food addict and you can always catch her chomping on something that’s probably not good for you. She is so excited to be a part of this blog because it allows her to share knowledge and make a difference in her community!",
      "id": 1807
    },
    {
      "title": "NA",
      "name": "Amanda Kang",
      "position": "Managing Editor ‘21",
      "bio": "Amanda graduated from POBJFK High School in 2021. Aside from writing for the Hawkeye, she was a part of the research program at school and very passionate about neuroscience, psychology, and biology. For fun, she loved to ice skate, run, and swim. Her favorite show was Parks and Recreation, but The Office was a close second, and she adored listening to pop music. She also loved to work with children; she had a job at an art studio where she helped them with art projects and she dedicated countless hours to volunteering with them. She is proud of the hard work that the Hawkeye does on a daily basis, so she hopes you enjoy the articles and Hawkeye Weekly! Now she is attending Northeastern University!",
      "id": 995
    },
    {
      "title": "NA",
      "name": "Jake Feldman",
      "position": "Editor-in-Chief ‘21",
      "bio": "Jake graduated from POBJFK High School in 2021. He previously served as the Sports Editor, Treasurer, and Editor-in-Chief for two years. Through the newspaper, he loved sharing the dynamic school culture and meaningful events occurring throughout his community. In addition to being active in the Hawkeye, he was also passionate about research, tennis, and community service. To this day, Jake’s favorite pastimes include reading novels, watching Survivor, and playing his trumpet. A fun fact about Jake is that he has his own business, where he has the pleasure of teaching children and adults the wondrous sport of tennis. He hopes that you enjoy learning about the latest news by reading the Hawkeye Weekly! Now he attends University of Pennsylvania where he is enrolled in a rigorous dentistry program!",
      "id": 1106
    },
    {
      "title": "NA",
      "name": "Jesse Ray Sheps",
      "position": "Editor-in-Chief",
      "bio": "​Jesse is a junior at POBJFK High School who loves to write. He created Hawkeye On The Street to modernize the newspaper! He spends a good amount of his time playing guitar and composing music. He is also an avid video gamer who is always up for a challenge. He is a professional actor and has appeared in different movies and television shows. Acting has allowed him to spend time with some amazing actors like Robert DeNiro and Kate Winslet and travel across the country to promote films at some amazingly cool festivals. He is probably proudest of the fundraising he has done for St. Judes Children’s Hospital by founding the Fire Island Film Festival.",
      "id": 1385
    },
    {
      "title": "NA",
      "name": "Fiona Wu",
      "position": "Multimedia Coordinator & Advertisement Representative",
      "bio": "Fiona is currently a senior in the POBJFK High School! She enjoys writing, dancing, watching TedTalks and Netflix, and listening to music. A fun fact about her is that she loves traveling, as she has been to ten countries and plans on visiting so many more. She is excited to be a part of Hawkeye and cannot wait to see what is in store for this year!",
      "id": 729
    },
    {
      "title": "NA",
      "name": "Ellisa Lee",
      "position": "Treasurer ‘21",
      "bio": "Ellisa graduated from POBJFK High School in 2021. Her hobbies included reading, art, fashion, and watching movies. She had big dreams for the future and planned on majoring in nursing in order to help others. As the Treasurer of the Hawkeye, she had the privilege of being part of an amazing board, and was given the great opportunity to plan new ideas. She enjoyed sharing her articles with everyone! Now she attends Hofstra University!",
      "id": 912
    },
    {
      "title": "NA",
      "name": "Annie Heischober",
      "position": "Arts & Entertainment Editor",
      "bio": "Annie is a senior at POBJFK High School and is ready for another year of writing for the Hawkeye. She is very involved in the music program at the high school including choir, orchestra, drama club, and being co-manager of one of the school's 8 student-run acappella groups. In her free time, she loves to hang out with friends, bike ride, play with her dog, and participate in school activities. Her favorite show is currently Grey’s Anatomy! She is so excited to be the Arts and Entertainment editor for the Hawkeye this year and also write articles for the blog.",
      "id": 1543
    },
    {
      "title": "NA",
      "name": "Justine Choi",
      "position": "News Editor",
      "bio": "Justine is a senior at POBJFK. She loves reading, writing articles, and learning new things. She makes an effort to stay informed about local and national events on a daily basis by reading and watching the news. Her favorite subject in school is science. In her free time, she enjoys watching movies, going on trail runs, traveling, and playing the piano.",
      "id": 1157
    },
    {
      "title": "NA",
      "name": "Mark Altstaedter",
      "position": "Secretary",
      "bio": "Mark is a sophomore at POBJFK High School. In his free time, he enjoys watching TV, reading, and playing tennis. He is very excited about starting the new school year!",
      "id": 1576
    },
    {
      "title": "NA",
      "name": "Brianna Rogers",
      "position": "Treasurer",
      "bio": "Brianna is a senior at POBJFK High School. Outside of school she is a competitive dancer, dance teacher, cheer coach, and “uber” for her friends. In her free time she is either watching the Vampire Diaries, going out to eat with her friends, shopping, or creative writing. Brianna is so excited to be a part of the Hawkeye Newspaper Club and looks forward to positively impacting her school community. Brianna cannot wait to share her thoughts and see what everyone else writes!",
      "id": 1357
    },
    {
      "title": "05/03/2021 Studying for the AP Exams",
      "body": "As the end of the school year draws closer, so do the AP exams. Here are some resources and strategies to help do your best. \n\nResources:\n- Review books, which contain practice questions and summaries, can be borrowed from the local library.\n- If you had taken AP exams last year, you probably remember the daily videos released by the College Board. They provide explanations of specific topics and testing tips from teachers. Playlists for each subject can be found on the Advanced Placement channel on Youtube.   \n- Old AP exams are a great way to practice. Free response questions from previous years, with sample answers and scoring guides, are available on the College Board website. These can be accessed by clicking on “AP Courses and Exams”, then “Course and Exam Pages.” Select your specific subject, click on “The Exam” and then scroll down. To find complete exams from previous years, PrepScholar recommends googling the name of the exam “along with ‘previously released materials college board’ or ‘completely released exams college board.” \n\nStrategies:\n- Studying with another person or in a group can help boost morale and hold you accountable. Many study by discussing and teaching information to others, which encourages one to retain information, understand, and rephrase it. \n- Make sure to space out the review of each topic. Instead of studying each topic extensively and then moving on to the next one, review a little of each topic over the span of multiple days. This allows you to practice retaining and recalling information.\n- Another effective studying strategy is to test yourself without any previous review. Then, you study and review topics like normal, spending a little more time on the topics you struggled with. Afterwards, take another practice test. Pre-testing has been proven to improve memory and performance on the post-test (according to the University of Chicago). \n- The Pomodoro Technique is a popular method that typically requires work sessions of about 25 minutes, with five-minute breaks in between. After four work sessions, there is a longer break of 15 minutes. This technique prevents burnout and increases productivity.\n\nTry not to study intensely and cram the day before the exam. Instead, skim over some important topics and anything you need to memorize. Eating breakfast, especially protein-rich foods, has been shown to improve exam performance. Most importantly, make sure to have a good night’s sleep the day before the test. Best of luck!",
      "author": "Isabella Chen",
      "id": 5
    },
    {
      "title": "04/26/2021 Is Major League Baseball Replay Broken?",
      "body": "Major League Baseball changed forever when the replay system was initially introduced in 2008.  While not all of the calls made by umpires can be changed, the number of correct calls has most certainly increased. The replay system enables umpires in all 30 MLB Stadiums to speak in real-time with those stationed at the Major League Baseball Replay Operations Center, back in New York City.  At the Replay Operations Center is an umpire and a trained technician, who are capable of viewing an infinite number of angles of the play in question.  Just within the past five days, there have been two game-altering plays that not only changed the course of the inning but also the game’s final score.  \n​\nWhen the Miami Marlins came to town to play the New York Mets at Citi Field on Thursday, May 9, both teams fought hard up until what became the final out, when Michael Conforto, an outfielder for the Mets, was at-bat.  The count was 1-2, and with one out in the bottom of the ninth inning, Conforto was hit by a pitch.  That was, at least, the call on the field.  Quite visibly, Conforto’s elbow was graced by what would have been a called strike three. Conforto’s elbow was stuck out, granting him the first base, and enabling the Mets to win the game. Even Ron Kulpa thought that the pitch was a strike three at the time of the at-bat, as he began to call the pitch as such, but then gestured to first base tapping on his arm, indicating that Conforto was hit by pitch.  Don Mattingly, the manager of the Marlins, proceeded to emerge from the visitors’ dugout at Citi Field.  Amidst a tirade from Mattingly, the umpires went to replay, but the original hit by pitch call stood and the Mets won on a fluke play that was galvanized by an error in the replay. \n\nMerely three days later, the Atlanta Braves were hosting the Philadelphia Phillies on national television, the Sunday Night Baseball game on ESPN.  Despite a barrage of home runs from Ozzie Albies, Rhys Hoskins, Didi Gregorious, Freddie Freeman, Bryce Harper, and Ronald Acuña Jr., the game was tied going into the top of the 9th inning.  Didi Gregorious, formerly a Red, Diamondback, and Yankee, hit a sac fly to Braves left fielder Marcell Ozuna.  Ozuna promptly fielded the ball and, like a cannon, threw it to catcher Travis d’Arnaud. d’Arnaud was able to put the tag on Alec Bohm (as seen above), although despite Bohm never touching home plate, he was called safe by both the home plate umpire and the replay center back in New York.  What happened is still unsure.  Obviously, umpires are human and make mistakes, but once viewing all three replay angles, the call should have been overturned.  Furthermore, after two mistakes in the same weekend, is it time for Major League Baseball to revamp their replay system?",
      "author": "Seth Schlank",
      "id": 6
    },
    {
      "title": "04/12/2021 A Comprehensive Junior Year Timeline for the Graduating Classes of 2023 and Beyond",
      "body": "If you think the college application process is daunting, do not fret. You’re not alone! In addition to being the most difficult years, the 11th and 12th grade have you engaged in a race to seek high-impact extracurriculars, brainstorm possible college essay ideas, and obtain recommendation letters, all while maintaining a satisfactory grade point average. Nonetheless, following a monthly timeline can help you win the “time to catch-up game” and avoid unnecessary stress. \n\nStart of Freshman Year - End of Sophomore Year:\n- Grades, grades, grades: Aim for that upward curve on your GPA!\n- Explore your interests through extracurriculars and electives that correlate with your interests: Try to find interests that you can commit to the rest of your high school years (not just for a few months). \n- When creating your schedules for upcoming years, attempt to take Advanced Placement Classes and Honors Classes that correlate with your interests.\n- Start conversations with your parents about how you will pay for college and start setting money aside (if you can): Understanding how you will pay for college and creating a college savings plan will alleviate some of the stress associated with the eventual economic commitment.\n- Explore scholarships: Yes! You can still apply for scholarships in the 9th and 10th grades. There are plenty of scholarship websites out there that can help you with this (ex: Scholly)\n- Don’t waste your summers: Find a job, volunteer, take a college class! Summers are precious and can help bolster your resume! Rising juniors can also prepare for the PSAT, SAT, and ACT.\n\nSeptember - October:\n- Study and take the PSAT: Scoring high can qualify you for a National Merit Scholarship.\n- Start exploring potential colleges and universities (make a list!).\n- Start ongoing preparation for a standardized test (SAT/ACT).\n\nNovember - February:\n- Take a standardized test (first try): Taking the test early can guarantee you have time to retake the test in the springtime if you did not do as well as you wanted to.\n- Revise your college list by sorting the universities into three different categories: Safety, Target, and Reach.\n- Register for college visits (in-person or virtual).\n- Keep looking for scholarships!\n- Start preparing for final AP Exams (the earlier you start, the better).\n\nMarch - May:\n- Take the SAT/ACT one more time if you think you can do better.\n- Prepare for the AP Exams: Do not wait until the last minute.\n- Start thinking about who you would like to write your recommendation letters: Think about two teachers in school (any year in high school).\n- Keep visiting colleges.\n- Keep looking for scholarships.\n\nJune - August:\n- Finalize your list of colleges: Determine application deadlines based on what type of application you will be submitting (Early Decision, Early Action, Regular Decision). \n- Draft your college application essays.\n- Begin requesting letters of recommendation.\n- Keep applying for scholarships.\n- Attempt to do one last valuable activity that can be added to your resume.\n- Take the SAT/ACT one last time (if you need to).\n\nSenior Year and Beyond:\n- Finalize college application essays.\n- Take the SAT/ACT if necessary (before December).\n- Secure your letter of recommendation.\n- Submit your applications!",
      "author": "Tarunika Sasikumar",
      "id": 7
    },
    {
      "title": "04/12/2021 Introducing the No Cap Podcast",
      "body": "Most of us agree the coronavirus pandemic has been very stressful for the last year. What better way to relieve stress than to sit back, relax, and enjoy a good podcast? Seniors Matthew Yoon, Joseph Kim, and Justin Kim have recently teamed up to create the No Cap Podcast. Here, the boys discuss a variety of enriching topics ranging from their life stories to relationships and food, with the help of special guests. \n\nNot only are these episodes entertaining to listen to, but they incorporate insight into how specific topics related to culture in modern-day life. Host Matthew Yoon says that “We started this podcast to learn the lessons people have accumulated throughout their lives. Especially due to COVID restrictions, we want to promote having meaningful conversations with people.” According to co-host Joseph Kim, “We wanted to start this podcast to make positive use of our free time and branch out of our comfort zones.” Co-host Justin Kim adds that “We figured it would be an interesting project to try out, considering the amount of extra time we had at home from the pandemic. We wanted to share our perspectives on certain topics, especially from the minority standpoint of Asian Americans.”\n\nThe boys work very hard on this podcast, and Matthew says that it is a project which he hopes to continue during college. Be sure to listen to the No Cap Podcast every Saturday on Spotify! \n\nFollow their Instagram! You can contact the hosts here to suggest new podcast ideas or ask to be a guest on a future episode: @ncp_podcast",
      "author": "Amanda Kang",
      "id": 8
    },
    {
      "title": "03/26/2021 Ivy Day",
      "body": "For high school seniors, the 2020-21 college application season has proven to be yet another challenge to navigate through during the COVID-19 pandemic. Across the Ivy League, selectivity among candidates dramatically increased: Ivy League institutions saw tremendous increases in the number of applications compared to last year. For example, Harvard University saw a yearly application increase of 42%. Similarly, Dartmouth saw a rise in applications of 32.5%. This uptick in applications is likely attributed to the schools’ test-optional policies, making applying more feasible. Due to the high volume, all Ivy League schools have pushed their admission decision release date to April 6. As an incoming freshman at the University of Pennsylvania this fall, I hope to welcome more of my fellow classmates to the Ivy League on April 6. Best of luck to all POB students on Ivy Day!",
      "author": "Jake Feldman",
      "id": 9
    },
    {
      "title": "03/23/2021 The Debate Over 3 Feet",
      "body": "School district leaders are hopeful for all in-person schools for fall 2021. Yet for this to become a reality some restrictions need to be revised so schools can accommodate all their students. One protocol being reviewed is the distance apart students can sit and remain safe. The current Center for Disease Control (CDC) guidelines are to keep students and staff six feet apart. Yet this is not feasible if all students return in the fall. Earlier this month, research has shown that students three feet apart with masking and desk shields pose no safety threat. The American Academy of Pediatrics and the World Health Organization (WHO) support this recommendation. Most districts adhere to the CDC standards and are awaiting their recommendations.\n\nMeanwhile, educators are brainstorming different approaches to bring back all students full-time. One concept suggested by Ron Masera, superintendent of the Center Moriches school district was to create an “overflow” classroom for those classes with high enrollment. For example, in large classes, students would sit in another room at school and follow the live instruction remotely on their chrome books. Students can take turns being in the “overflow” room possibly only attending once a week. The benefit would be they are still in school seeing peers and attending their regular classes that have fewer students. Utilizing gyms, lunchrooms, and auditoriums for large classes is another option.\n\nRemote learning, while improved from last year of recorded videos and self-guided assignments, has been a real challenge for some students. Their grades have suffered along with emotional stress. The best thing we can do for the students is to get them back into school, safely. By the fall, Nassau county will hopefully be reaching herd immunity. This means that seventy-five percent of Nassau residents will be vaccinated. Once this occurs the virus will less likely spread. Tests are being conducted on children under 16. Vaccines may be available for them in the fall. All of this points to a “positive” future  - and I’m not referring to covid results.",
      "author": "Alison Chertoff",
      "id": 10
    },
    {
      "title": "03/23/2021 COVID-19 Update",
      "body": "The COVID-19 virus still wields a tremendously deadly punch, and all protections must continue to be followed by individuals. However, there is some good news on the horizon. New York, and the rest of the nation, are continuing to see a steady reduction in the number of COVID-19 cases. This reduction in infections has led some state Governors to roll back some of their original restrictions. Much of this positive outlook is due to the federal government’s increased deployment of COVID-19 vaccines. It’s hard to imagine that in little over one year, we already have not one, but three effective vaccines saving lives from the threat of this deadly pandemic.\n\nThe most recent positive development is that The Food and Drug Administration has approved the distribution of Johnson & Johnson’s single-shot COVID-19 vaccine for emergency use, which will provide a third effective vaccine for Americans.\n\nAlthough millions are still battling to find their place in line for the vaccine, Johnson & Johnson has pledged to provide 100 million doses in this country by July 1, 2021. Taking this new third life-saver, and adding it to the 600 million doses from the two-shot Pfizer and Moderna vaccines, there should be a vaccine for every American adult who wants one by early summer, 2021. \n\nThere is one potential drawback to the third new vaccine- it reportedly only has a 72 percent efficiency rate, compared to the 95 percent efficacy rate for the other two already being distributed across the country. However, all three vaccines have proven to stop serious illness and death. The truth is that if one year ago, someone said we would have a vaccine that was 72% effective, everyone would have been thrilled. We finally seem to have some positive movement on the COVID-19 front and we can only continue to hope that any new variants of the virus, such as the South African or United Kingdom strains, are equally put in check by the three vaccines we now have in our arsenal.",
      "author": "Jesse Ray Sheps",
      "id": 11
    },
    {
      "title": "03/08/2021 Dr Seuss Controversy",
      "body": "Dr. Seuss Enterprises recently announced that six of the famous children’s books will no longer be published, due to the racist and insensitive imagery shown in them. The six books are And to Think That I Saw It on Mulberry Street, If I Ran the Zoo, McElligot's Pool, On Beyond Zebra!, Scrambled Eggs Super!, and The Cat's Quizzer. Examples of offensive stereotypes in these books include drawing black boxers as gorillas, leaning into harmful Jewish stereotypes, and portraying an Asian person wearing a conical hat, holding chopsticks, and eating from a bowl. Although the discontinuation of these books had good intent, many are still upset by the news of the famed author’s books. The Foundation Against Intolerance and Racism recently developed a website called “Banned, Seuss 2020” and they say “Erasing books is insanity. Stand up for our common humanity.”\n\nSince the discontinuation of these six books, sales in Dr. Seuss literature have skyrocketed. His books became rare collectibles almost instantly, and Dr. Seuss books currently make up about half of Amazon's top 20 bestseller books. However, there remains a small dilemma for libraries all over the world. On one hand, banning the books would allow for there to be less insensitive material, but on the other hand, telling a child they cannot read the book is a form of censorship and intrusion on their intellectual freedom. The conflict is between values of free expression and acknowledging that some content may be hurtful. Even though this may seem like a difficult situation, it is unlikely that the libraries will pull a book even when some find it racist or otherwise offensive; it will probably merely be placed in a more inconspicuous location. \n\nAlthough it is a controversial topic, authors who tailor their books towards children should still be very aware of the influence their imagery can have on a kid. Rebekah Fitzsimmons, an assistant teaching professor at Carnegie Mellon University, tweeted “The books we share with our children matter. Books shape their worldview and tell them how to relate to the people, places, and ideas around them. As grown-ups, we have to examine the worldview we are creating for our children, including carefully re-examining our favorites.” Although it is sad to see six classics be discontinued, it is ultimately for the best. This way, fewer children will be exposed to the offensive stereotypes portrayed in the books, hopefully allowing them to generate their own feelings without subconsciously feeling prejudice toward any certain group.",
      "author": "Fiona Wu",
      "id": 12
    },
    {
      "title": "03/08/2021 Tri-M",
      "body": "Due to the Covid-19 Pandemic, numerous in-person planned events were canceled. However, every society and club in Plainview Old-Bethpage JFK High school is exploring innovative ways to effectively knit their community together despite the distance. The TRI-M society is making a study playlist - a youtube video compilation showcasing their members' musical talent. From string instruments, band instruments, to singing, the playlist includes a diverse array of student-selected pieces. Happy listening!",
      "author": "Ellisa Lee",
      "id": 13
    },
    {
      "title": "02/23/2021 Winter Storm in Texas? Yes.",
      "body": "As New Yorkers, snow in the winter is all but uncommon. While two inches of snow here may feel like we have avoided a destructive winter storm, there are some areas in the country where snow is just as uncommon as an alien ship. One of those areas is the state of Texas.\n\nOver the past few weeks, parts of Texas had temperature drops that are more extreme than any other since 1989. With these temperatures, precipitation that would normally come in the form of heavy rain has changed to unprecedented snow and ice. This unusual storm has captivated the country and overtaken the state. Because Texas typically has a warm climate, government officials, individuals and households were unprepared for the change in weather. These winter storm conditions have caused many power outages, a lack of running water, and created an overall unsafe living environment. This left many people with damaged property (burst pipes), lacking heat and food and no way to shovel or plow the snow away. So far there have been about 26 deaths due to the harsh conditions\n\nWhat would normally be an extreme scenario has become even more of a struggle with the added issues that COVID-19 brings. People have less of an opportunity to stay together, for warmth, in the very few areas that do have electricity and heat. Although this has been a difficult scenario for all Texans, many have been making due by wrapping themselves in blankets, moving into their cars or going to “warming centers” that have been opened by government officials. \n\nWith the hard times Texas has faced there is good news ahead. The wintery conditions in Texas are about to leave as soon as they arrived. Temperatures are supposed to rise up to 50 and 60 degrees within the next week which will likely melt most of the snow. With the snow gone and help from relief foundations around the country, workers should be able to get power back on and water running very soon. These have been a difficult few weeks for Texans and their families. Hopefully, things will get back to normal soon.",
      "author": "Jess Levy",
      "id": 14
    },
    {
      "title": "02/21/2021 Super Bowl LV",
      "body": "While our lives have drastically changed over the past year, one event continues to excite American football fans across the country. On February 7, the 55th Super Bowl commenced as usual, with the Kansas City Chiefs defending their title against the Tampa Bay Buccaneers. Although the Football Power Index, along with 109 experts reported by ESPN, predicted a Chiefs victory, the Buccaneers won 31- 9. The game earned Tom Brady (the Bucs quarterback) his seventh win, a feat accomplished by no other player or NFL team. The MVP award also went to the star, making it Brady’s fifth Super Bowl MVP, extending his previous record. \n\nFor the much anticipated halftime show, Grammy-winning singer, The Weeknd, performed on the grand stage. Spending nearly $7 million out of his own pocket, he blew the crowd away with his elaborate and flashy performance. Starboy, The Hills, Can't Feel My Face, I Feel it Coming, Save Your Tears, Earned It, House of Balloons/Glass Table Girls, and Blinding Lights were all included in the show. Unfortunately, due to COVID-19 protocols, there were no surprise guests. Instead, the singer had an army of bandaged dancers, later explaining (in an interview with Variety) that the significance of the head bandages was a reflection on the “absurd culture of Hollywood celebrities and people manipulating themselves for superficial reasons to please and be validated.”\n\nThe Super Bowl is always known for their popular, but expensive and competitive advertisements. With their iconic commercials and celebrity cameos, the short videos share the spotlight with the actual game. Due to the current circumstances, however, many companies such as Budweiser and Coke, chose not to run commercials during this year’s game. CBS reportedly took two more months than usual to sell the spots. Moreover, they charged $5.5 million for a 30-second slot which is lower-priced than usual. Amongst the variety of comedic and sentimental commercials, USA Today’s Ad Meter ranked Rocket Mortgage: “Certain is Better- Tracy Morgan, Dave Bautista & Liza Koshy,”  Rocket Mortgage: “Certain is Better- Tracy Morgan & Joey Bosa,” Amazon: “Alexa’s Body,” M&M’s: “Come Together,” and Toyota: “Upstream” as the top 5 Super Bowl ads. \n\nAs for the usual packed crowd who cheers alongside their teams, only 25,000 people were part of the audience this year, distanced by 30,000 cardboard cutouts of celebrities and fans. ",
      "author": "Christine Song",
      "id": 15
    },
    {
      "title": "02/08/2021 The 2021 AP Exams",
      "body": "Given the current situations of the Covid-19 pandemic, College Board has made changes to how the AP exams will be administered for 2021. To ensure the health and safety of both teachers and students, they have created 3 different exam schedules that will be on paper or digital.\n\nAdministration 1 will be between May 3-7, 10-12, 14, and 17. This will be a traditional, full-length paper exam that students will have to take in school.\n\nDigital exams will be the format for some subjects in Administration 2 and 3. Administration 2 is between May 18-21, 24-28. There will be a total of 17 subjects with a digital exam and 15 subjects with a paper exam. Administration 3 is between June 1-4 and 7-11. There will be a total of 25 subjects with a digital exam and 7 subjects with a paper exam. \n\nDigital exams will be full-length exams that will cover all of the topics for that given course. They can be taken in school or at home. For in-school digital exams, each student will need access to a laptop that is fully charged, can access the school’s internet network, and has a built-in camera. For at-home digital exams, each student will need access to a laptop or desktop computer with a good internet connection and has a built-in camera. For both in school and at home digital exams, students have to install the College Board’s LockDown Browser application, which has been designed to monitor internet connection issues throughout the exam. \n\nUnlike the 2020 AP exams where you could use the internet and your notes to search up questions, the digital 2021 AP exams will not have any questions that can be answered using those resources. Additionally, students will not be able to go back and forth between questions throughout the digital exam.",
      "author": "Elif Koch",
      "id": 16
    },
    {
      "title": "02/08/2021 The Hot Stove",
      "body": "In the past few weeks, a hot stove that has been anything but hot, has begun to heat up.  On January 7th, Shortstop Francisco Lindor and Starting Pitcher Carlos Carrasco were traded to the New York Mets in exchange for Shortstops Andres Gimenez and Amed Rosario, Outfielder Isaiah Greene, and Right Handed Pitcher Josh Wolf, the Mets’ 2019 second-round draft pick to the Cleveland Indians. This trade was not something that Mets fans were complaining about, nor were they completely blindsided by it. Lindor had been rumored to be getting traded for a long time, and by this point, the Mets were among the top suitors for the shortstop.  Giminez signed with the Mets as an international free agent back in 2016, and made his Major League Baseball debut with the club in the pandemic-shortened 2020 season. Upon debuting, Gíminez kicked out Amed Rosario out of the starting shortstop role. Rosario hit just .252/.272/.371 and failed to steal a single base. It will be interesting to see how this situation will pan out over in Cleveland. I am in the camp of believing the Mets won this trade, but I think that Greene and Wolf- the Mets’ number 9 and number 10 prospects, respectively, prior to the trade- should have been swapped out for another pair of prospects.\n\nRoughly 20 minutes from the Mets’ home of Citi Field, sits Yankee Stadium, the Yankees’ home stadium during baseball season. The Yankees have also made splashes of their own in Corey Kluber and Jameson Tallion. Kluber pitched just 36.2 innings over the past two seasons while dealing with a laundry list of injuries. Before this deal was made, to bring Kluber over to the Yankees on a one year deal, there was a lot of uncertainty surrounding the Yankees rotation. Gerrit Cole was clearly the ace, but after that, the remaining five man rotation lacked substance. Luís Severino is slotted into the rotation, but it will not be until July before we see Severino back in the Yankees pinstripes. Not long after the Kluber deal was struck, the Yankees sent pitchers Miguel Yaruje and Roansy Contreras, infielder Maikol Escotto and left fielder Canaan Smith in exchange for another rotation bolster and good friend of Gerrit Cole, Jameson Tallion. Although he has faced a number of obstacles, coming off of two Tommy John surgeries and beating cancer, Tallion is back and ready to dominate opposing lineups in the Bronx. New York native Adam Ottavino was shipped up to the Boston Red Sox along with the Yankees number 24 prospect, Frank German, in exchange for a cash consideration or a player to be named later. It was the first Red Sox-Yankees trade since 2014, when Stephen Drew went to New York in exchange for Kelly Johnson. In my opinion, all of these moves have upgraded the Yankees and equipped them for multiple World Series runs in the near future.\n​\nBoth New York teams have dominated the offseason, even if the hot stove didn’t get ignited until late into the offseason.",
      "author": "Seth Schlank",
      "id": 17
    },
    {
      "title": "01/25/2021 Girls Winter Track at POBJFK",
      "body": "Last Wednesday was the first meet of the 2021 girls’ winter track season at POBJFK! Despite the challenging circumstances presented this year, the girls’ winter track team is still going strong and the team is able to proudly run and represent our school. This season, all of the girls were very excited to reunite with their team members and train together amidst the craziness of this year. Distance runner Emilly Weprin says, “I love track, running, and being a member of the long-distance team!”\n\nAs for the logistics of the sport during this time, track is considered a low-risk sport because it takes place outdoors and naturally does not involve any physical contact between athletes. However, there were still a few adjustments that needed to be made in order to allow for track to continue. All team members are required to wear masks during practices and fill out health screeners prior to training. Meets have been altered as well. Rather than running against athletes from other schools in-person, the team now participates in virtual meets. Only the athletes from our school are present at the meet and have their times recorded by an official. These times are later compared to those of athletes from other schools. \n​\nWhat matters most is that the girls’ team is still able to revel in the fun and competitive spirit that is guaranteed to come from a team sport, as eloquently stated by sprinter Melissa Wynne, “I love track because it gives you the drive to run and a common goal to share with your team. I love the feeling of accomplishment and satisfaction after the race.”\n\nGreat job to the girls’ winter track team!",
      "author": "Amanda Kang",
      "id": 18
    },
    {
      "title": "12/14/2020 Food Service",
      "body": "This September, our school food service started offering free meals using funding provided by the US Department of Agriculture (USDA). We were told that they would last until December 31, 2020, or until available funding for the program had been exhausted. This option was also made available to fully remote students, who could schedule a pick-up of the no-cost meals. Three months later, this blog article is a reflection of the program and how it has benefited us as students.\n\nThe food options offered by our school include bagels and string cheese, vanilla fruit yogurt parfait, a hamburger/cheeseburger, chicken or spicy chicken sandwiches, ham and turkey sandwiches, chicken caesar wraps, garden salad or crispy chicken salad, pizza, and a daily hot meal. The hot meal options can be found on the school menu available on our district website. Daily fruit and vegetable offerings are also available: apples, oranges, apple juice, apple cherry juice, carrot sticks, and celery sticks. It is impressive to consider that all these foods are free, particularly since there are an abundance of options. \n\nThis program has provided students access to nutritious food throughout the nation, regardless of financial circumstances surrounding the Covid-19 pandemic. In October, Secretary Perdue stated, “As our nation recovers and reopens, we want to ensure that children continue to receive the nutritious breakfasts and lunches they count on during the school year wherever they are, and however they are learning.” Some students in our school have been impacted by the pandemic worse than others, whether academically, financially, or related to mental health, but the free food options have brought a sense of normalcy and stability to all of us. \n\nIn this way, our free food program has had overwhelmingly positive results. If nothing else, it’s made buying lunch absolutely painless when I’ve forgotten to bring food. In the past, my grandfather used to buy sandwich foods for me to bring to school, but right now we are trying to distance ourselves as much as possible. So instead of cooking, preparing a thermos, or bringing junk food with me (neither is a good option), I’ve been able to get a great quality free lunch instead.",
      "author": "Michael Khalfin",
      "id": 19
    },
    {
      "title": "12/01/2020 Election 2020: What Exactly Just Happened?",
      "body": "2020 has been a bizarre year on just about every front. No one should have realistically expected the contentious U.S. Presidential elections to have been immune from also being “unprecedented” in nature. Nearly one month has passed since the November 3rd election between incumbent President Donald J. Trump and former Vice President Joseph R. Biden and there is still an ongoing debate between them as to who will be officially sworn into office on January 20, 2021.\n\nPresident Trump held a fairly strong lead based upon voting on Election Day leading some to believe the President was sailing smoothly into a second term. However, there were still millions of mail-in ballots that needed to be counted after Election Day and this process took nearly a week to complete in many key electoral states. When the counting was ultimately finished, Biden had over 80 million votes; a new voting record that was nearly 6 million more than Trump. More importantly, Biden appeared to have passed the important “270” mark of electoral votes necessary to win the White House. \n\nPresident Trump refused to concede he had lost the election claiming election irregularities and fraud in six different states as the reason for the difference. Trump filed various lawsuits in different states alleging that local election officials failed to follow the law when counting ballots, leading to Biden’s accumulation of fraudulent votes. Former New York City Mayor Rudy Giuliani headed up the President’s legal challenges. The media widely discredited Trump’s claims and pronounced the former Vice President as the next President-elect.\n\nThe battle between Trump and Biden continues and has already reached the federal appellate courts. The nation may hear a final determination in the matter from the United States Supreme Court. However, one federal court hearing President Trump’s claims of corruption and cheating has already weighed in with its own opinion this past week stating in its recently published legal decision that “free, fair elections are the lifeblood of our democracy. Charges of unfairness are serious, but calling an election unfair does not make it so. Charges require specific allegations and then proof. We have neither here.” So far, the courts have generally not been supportive of President Trump's various challenges, and many public officials, including some Republicans, have called for him to concede the election to Biden.\n\nPresident Trump has continued to dispute Joe Biden’s 2020 election victory and there appears to be no immediate end in sight. President Trump has remained generally defiant despite recently authorizing his administration to begin working with Biden on a transition- which some thought may be a signal that Trump will ultimately respect the process and acknowledge Joseph Biden as the 46th President of the United States of America. However, a new resolution signed more recently by Pennsylvania House Republicans, has called upon state leaders to withdraw the presidential election results in favor of Biden and appoint their own electoral college delegates which would presumably work in Trump’s favor in the critically important state of Pennsylvania. The President appears to be working on the local level to convince state legislators to hand him over electoral votes despite the popular count of votes in favor of Biden because of his claims of voter fraud. The road ahead for success on the local level is arguably going to be difficult for the incumbent President.\n\nRecounts and election lawsuits themselves are nothing new. In the 2000 presidential election, a slim margin of victory by President Bush in Florida ultimately triggered a recount in all counties. Al Gore later filed a lawsuit to force hand recounts in several Florida counties. However, ultimately Gore conceded that he had lost and the nation went forward.\n​\nWe predict that there will be an end to this debate shortly, with more national Republican members ultimately telling President Trump that he has lost his challenges and needs to immediately cooperate in the transition of power to the next President, Joe Biden on January 20, 2021. December will be a very intriguing month as we close out this unprecedented year. There is no doubt more drama and twists will grow in this presidential story.",
      "author": "Jesse Ray Sheps",
      "id": 20
    },
    {
      "title": "11/23/2020 Pandemic Fatigue... The New Culprit of Coronavirus Cases",
      "body": "As the spring and summer months marked by fear, concern, and safety drew to a close, many individuals are starting to risk the dangers of Covid-19 solely due to exhaustion of the pandemic. The summer did not eradicate the virus, and this fall, cases are beginning to surge once again. Searching for effective methods to tackle this fatigue and reinvigorate public vigilance is a growing challenge as the crisis continues.\nSo what are some things you can do to ease this challenge?\n\n1. Make a promise to yourself.\nIt is no surprise that people were going to be tired of staying locked up inside their houses. Therefore, if you plan on going somewhere, commit to staying the safest you can. Wear a mask at all times and ensure that you are socially distancing yourself from others. Do the proper thing to ensure that you and your loved ones remain safe, even if it is a slight inconvenience. \n\n2. Read about Covid-19 stories\nFor some individuals, especially on Long Island, getting the virus is an abstract idea. We think it's something that happens to other people in other parts of the country. However, this is not true. Covid-19 can affect anyone, including you and your family. When you read stories about other people’s coronavirus journeys, it becomes personal to you, motivating you to stay safe. \n\n3. Make precautions a second nature to you\nYou shower every single day and brush your teeth to make sure you practice good hygiene. The key is to have the same outlook on the virus. Take precautions like disinfecting your groceries and mail and make them second nature. No matter how much it seems like a chore, know that it's the safe thing to do. Eventually, putting a mask on or washing your hands often will become routine.\n\nThe good news is that there are vaccinations in the works that have boasted high treatment rates. As of right now, there is no set release date for these vaccinations, but sit tight as they will reach us soon! Stay safe, everyone!",
      "author": "Tarunika Sasikumar",
      "id": 21
    },
    {
      "title": "11/16/2020 Coming to a Mall Near You",
      "body": "As the Covid cases continue to rise in our area, new ideas on how testing can be made more available are being introduced. Starting at the end of the month, there will be “pop up” labs in mall parking lots. You can find them at Roosevelt Field, Smithhaven, and Walt Whitman malls. These collection sites will offer two kinds of tests. They will be able to test for the current presence of Covid and antibodies. A rapid antibody test (where you get the results within a day) will cost $59. The more invasive, yet more accurate test for Covid will cost $179. The temporary sites will accept insurance.\n\nNow holiday shoppers can pick up gifts and a Covid test at the same location. These temporary sites will remain open until the pandemic is over. They may be transformed into vaccination sites once that is available to the general public. We can only hope that the convenience and additional testing will limit the spread.  A vaccination is in the works and hopefully, as we do our spring shopping, this will all be part of our history. Stay safe everyone!",
      "author": "Alison Chertoff",
      "id": 22
    },
    {
      "title": "11/09/2020 Book Fairies",
      "body": "For the first Issue of the 2020-2021 school year, the Hawkeye Newspaper club has organized a fundraiser towards promoting reading literacy. In New York State, there are over 3.4 million individuals who lack English language proficiency, and this number is only rising due to the onset of the obstacles associated with Covid-19.\n\n​With schools reopening during a difficult time, we decided to partner with Book Fairies, an organization that collects reading materials for people in need throughout metropolitan New York. These reading materials foster literacy and academic success and nurture a love for reading/writing. I am proud to report that the club will be donating $800+ towards this worthy cause.",
      "author": "Jake Feldman",
      "id": 23
    },
    {
      "title": "10/23/2020 Interview with Principal Murray - Our School Wins the Blue Ribbon Award",
      "body": "This year, three Long Island schools were selected for the Blue Ribbon Award: Wantagh, West Islip, and our school, POBJFK. We were recognized for superior graduation rates and test scores. According to the latest data, there are only 366 other schools out of roughly 10 that received this award. This puts us in the top 3.5% nationwide. To talk about our achievement, I sat down with our principal, Mr. Murray during my lunch period.\n\nWhat factors led our school to being chosen?\n\nWhen they are evaluating a high school, the Blue Ribbon Schools Program ignores minute details. Instead, they focus on the overall picture. Our school offers a variety of courses across subject areas. Student achievement programs (extracurriculars, in the form of clubs and sports) target students with diverse interests. Teachers use innovative teaching strategies, including the use of technology, to tackle course material. Data performance results are used to evaluate students’ performance and change the teacher’s approach when necessary.\n\nWhat does this award mean for our school and community?\n\nOftentimes, people move to towns based on the schools. Now that we have won this award, people will want to move to Plainview. Real estate agents will use this knowledge when they are selling homes. Additionally, students who graduate over the next few years can write that our school achieved a Blue Ribbon Award on their transcripts. Colleges will recognize that the students graduated from an honorable school and that they played a role in creating this successful environment.\n\nWhen considering our students’ foundations it is also worth noting our primary education. Our elementary and middle school teachers encouraged us to work hard and gave us the knowledge to succeed at the high school level.\n\nDid you anticipate winning this award, and what was your reaction when you found out?\n\nMr. Murray did not anticipate winning. In fact, he almost didn’t complete the application. During quarantine, his top priority was trying to create an effective learning program for the students. This left little time to focus on anything else. What’s more, our high school had never applied for the Blue Ribbon Program in the past and the paperwork was quite challenging and detailed. The application process required him to provide hard facts in sections with limited word counts.\n\nBefore the results were finalized, the National Blue Ribbon Schools Program kept dropping hints that we would win. Administrators and board representatives kept telling him that “we got it” and that “it’s in the bag,” but Mr. Murray refused to believe it until he saw it. On Thursday, September 24, teachers, students, and administrators alike were going to get together by the school’s TV to witness our school getting recognized. Unfortunately, this became a full remote day when a Coronavirus case was reported.\n\nWhen reflecting on this award, Mr. Murray says that he is proud of our school community for their consistent hard work. Before retiring he wanted to leave his mark on the high school. Certainly he has done that. “I was part of making this a reality for our school,” he says.",
      "author": "Michael Khalfin",
      "id": 24
    }
  ]
}
